package com.together.nosheng.util;

import android.util.Log;

import java.lang.reflect.Array;
import java.util.ArrayList;
import java.util.Arrays;
import java.util.HashMap;

public class SvmModel {

    private ArrayList<Integer> MONTH  = new ArrayList<Integer>(Arrays.asList(1,2,3,4,5,6,7,8,9,10,11,12));
    private ArrayList<Integer> BNUM = new ArrayList<Integer>(Arrays.asList(1,2));
    private ArrayList<Integer> NUM = new ArrayList<Integer>(Arrays.asList(1,2,3,4,5,6,7,8));
    private ArrayList<Integer> BAGE = new ArrayList<Integer>(Arrays.asList(1,2,3,4,5,6,7));
    private ArrayList<Integer> ResultCode = new ArrayList<Integer>(Arrays.asList(21090, 21090, 21090, 39020, 39020, 39020, 39020, 21090, 21090, 21090, 21090, 32060, 37010, 37010, 32030, 32030, 21090, 21090, 32060, 32060, 32060, 32030, 32030, 21090, 21090, 32060, 32060, 32060, 32030, 32030, 21090, 21090, 32060, 32060, 32060, 37020, 37020, 37020, 37020, 32060, 32060, 32060, 37020, 37020, 37020, 36020, 36020, 36020, 36020, 32060, 32060, 32060, 36020, 36020, 36020, 36020, 21090, 21090, 21090, 39020, 39020, 39020, 21090, 21090, 21090, 21090, 21090, 39020, 21090, 21090, 32030, 32030, 32030, 21090, 21090, 21090, 32060, 32030, 32030, 32030, 21090, 21090, 32060, 32060, 32030, 32030, 32030, 21090, 21090, 32060, 32060, 37020, 37020, 37020, 37020, 36020, 36020, 32060, 37020, 37020, 37020, 36020, 36020, 36020, 36020, 37020, 37020, 37020, 36020, 36020, 36020, 36020, 21090, 21090, 21090, 39020, 39020, 39020, 39020, 21090, 21090, 21090, 37020, 32060, 37010, 37010, 21090, 21090, 21090, 21090, 32060, 37010, 37010, 21090, 21090, 21090, 21090, 32060, 32060, 32060, 32030, 37020, 37020, 37020, 32060, 32060, 32060, 37020, 37020, 37020, 37020, 32060, 32060, 32060, 32060, 37020, 37020, 37020, 36020, 36020, 36020, 32060, 32060, 32060, 36020, 36020, 36020, 36020, 21090, 21090, 39020, 39020, 39020, 39020, 21090, 21090, 21090, 37020, 37020, 39020, 21090, 21090, 21090, 21090, 37020, 37020, 21090, 21090, 21090, 32030, 32030, 37020, 37020, 21090, 32060, 32060, 32030, 37020, 37020, 37020, 36020, 32060, 32060, 37020, 37020, 37020, 37020, 36020, 36020, 32060, 37020, 37020, 37020, 37020, 36020, 36020, 36020, 32060, 32060, 32060, 36020, 36020, 36020, 36020, 21090, 21090, 21090, 39020, 39020, 39020, 39020, 21090, 21090, 21090, 37020, 37020, 37010, 37010, 21090, 21090, 21090, 37020, 37020, 32060, 37010, 21090, 21090, 37020, 37020, 37020, 32060, 32060, 36020, 37020, 37020, 37020, 37020, 37020, 38050, 39020, 39020, 39020, 39020, 32060, 37020, 32060, 39020, 39020, 39020, 39020, 37020, 32060, 32060, 39020, 39020, 39020, 39020, 37020, 36020, 37010, 21090, 21090, 39020, 39020, 36020, 36020, 36020, 21090, 21090, 37020, 37020, 36020, 36020, 32030, 37020, 37020, 37020, 37020, 37020, 36020, 32030, 36020, 37020, 37020, 37020, 37020, 37020, 37020, 36020, 37020, 39020, 39020, 39020, 36020, 37020, 39020, 39020, 39020, 39020, 39020, 36020, 36020, 39020, 39020, 39020, 39020, 39020, 36020, 36020, 39020, 39020, 32060, 32060, 36020, 36020, 39010, 21090, 21090, 21090, 39020, 39020, 39020, 39020, 21090, 21090, 36020, 37020, 37020, 37020, 37020, 21090, 36020, 36020, 37020, 37020, 37020, 37020, 36020, 36020, 37020, 37020, 37020, 37020, 37020, 36020, 39020, 39020, 32060, 37020, 37020, 37020, 39020, 39020, 39020, 39020, 32060, 37020, 37020, 39020, 39020, 39020, 39020, 32060, 37020, 37020, 39020, 39020, 39020, 39020, 37020, 37020, 37020, 21090, 21090, 39020, 39020, 36020, 36020, 39020, 21090, 37020, 37020, 37020, 37020, 37020, 39020, 37020, 37020, 37020, 37020, 37020, 37020, 37020, 36020, 37020, 37020, 37020, 37020, 37020, 37020, 36020, 39020, 39020, 39020, 39020, 39020, 37020, 39020, 39020, 39020, 39020, 39020, 39020, 37020, 39020, 39020, 39020, 39020, 39020, 37020, 37020, 39020, 39020, 39020, 32060, 32060, 37020, 37020, 21090, 21090, 21090, 21090, 39020, 39020, 39020, 21090, 21090, 36020, 36020, 37020, 37020, 39020, 36020, 36020, 36020, 36020, 37020, 37020, 37020, 36020, 36020, 36020, 37020, 37020, 37020, 37020, 36020, 36020, 32060, 32060, 37020, 37020, 37020, 39020, 39020, 39020, 32060, 32060, 32060, 37020, 39020, 39020, 39020, 32060, 32060, 37020, 37020, 39020, 39020, 39020, 32060, 37020, 37020, 37020, 21090, 21090, 21090, 39020, 36020, 39020, 39020, 21090, 21090, 37020, 37020, 37020, 37020, 39020, 37020, 37020, 37020, 37020, 37020, 37020, 39020, 36020, 37020, 37020, 37020, 37020, 37020, 39020, 36020, 39020, 39020, 39020, 39020, 39020, 39020, 39020, 39020, 39020, 39020, 39020, 39020, 39020, 39020, 39020, 39020, 32060, 32060, 32060, 37020, 39020, 39020, 39020, 32060, 37020, 37020, 37020, 21090, 21090, 21090, 21090, 39020, 39020, 39020, 21090, 21090, 36020, 36020, 36020, 37020, 39020, 21090, 36020, 36020, 36020, 37020, 37020, 32060, 21090, 32060, 32060, 37020, 37020, 37020, 32060, 32060, 32060, 32060, 32060, 32060, 32060, 32060, 32060, 32060, 32060, 32060, 32060, 32060, 32060, 39020, 39020, 39020, 32060, 32060, 32060, 31370, 39020, 39020, 39020, 32060, 32060, 31370, 37020, 21090, 21090, 21090, 21090, 39020, 39020, 39020, 21090, 21090, 21090, 37020, 37020, 37020, 39020, 21090, 21090, 37020, 37020, 37020, 37020, 39020, 21090, 32060, 32060, 37020, 37020, 32060, 32060, 32060, 32060, 32060, 32060, 32060, 32060, 32060, 32060, 32060, 32060, 32060, 32060, 32060, 32060, 38090, 38090, 32060, 32060, 32060, 32060, 31370, 38090, 38090, 32060, 32060, 32060, 31370, 31370, 21090, 21090, 21090, 21090, 39020, 39020, 39020, 21090, 21090, 21090, 36020, 36020, 36020, 32060, 21090, 21090, 32060, 32060, 32060, 32060, 32060, 21090, 32060, 32060, 32060, 32060, 32060, 32060, 32060, 32060, 32060, 32060, 32060, 32060, 32060, 32060, 32060, 39020, 39020, 32060, 32060, 32060, 34380, 39020, 39020, 39020, 32060, 32060, 31370, 34380, 34380, 39020, 39020, 32060, 31370, 31370, 21090, 21090, 21090, 21090, 36020, 39020, 39020, 21090, 21090, 21090, 37020, 36020, 36020, 39020, 21090, 21090, 32060, 32060, 32060, 32060, 32060, 21090, 21090, 32060, 32060, 32060, 32060, 32060, 32060, 32060, 32060, 32060, 32060, 32060, 32060, 32060, 32060, 32060, 32060, 32060, 32060, 32060, 34380, 38090, 32060, 32060, 32060, 32060, 31370, 34380, 34380, 32060, 32060, 31370, 31370, 31370, 21090, 21090, 21090, 39020, 39020, 39020, 39020, 21090, 21090, 21090, 36020, 36020, 32060, 32060, 21090, 21090, 32060, 32060, 32060, 32060, 32060, 21090, 32060, 32030, 32060, 32060, 32060, 32060, 32060, 32060, 39020, 39020, 32060, 32060, 32060, 32060, 32030, 39020, 39020, 39020, 32060, 32060, 34380, 39020, 39020, 39020, 39020, 32060, 32060, 34380, 34380, 34380, 39020, 34380, 31370, 31370, 21090, 21090, 21090, 21090, 36020, 36020, 39020, 21090, 21090, 21090, 32060, 32060, 32060, 32060, 21090, 21090, 32060, 32060, 32060, 32060, 32060, 21090, 21090, 32060, 32060, 32060, 32060, 32060, 21090, 32060, 32060, 32060, 32060, 32060, 32060, 32060, 32060, 39020, 39020, 32060, 32060, 32060, 34380, 34380, 39020, 39020, 32060, 32060, 32060, 34380, 34380, 38100, 32060, 32060, 31370, 31370, 21090, 21090, 21090, 39020, 39020, 32060, 32060, 21090, 21090, 21090, 32060, 32060, 32060, 32060, 37020, 21090, 32060, 32060, 32060, 32060, 32060, 37020, 37020, 39020, 39020, 32060, 32060, 32060, 32060, 32060, 39020, 39020, 39020, 39020, 32060, 32060, 32030, 39020, 39020, 39020, 39020, 32060, 31370, 34380, 39020, 39020, 39020, 39020, 32030, 34380, 34380, 34380, 34380, 32030, 32030, 32030, 21090, 21090, 21090, 21090, 32060, 32060, 32060, 21090, 21090, 21090, 32060, 32060, 32060, 32060, 21090, 21090, 21090, 32060, 32060, 32060, 32060, 21090, 21090, 39020, 32060, 32060, 32060, 32060, 21090, 32060, 39020, 39020, 39020, 32060, 32060, 32060, 32030, 39020, 39020, 39020, 21090, 32060, 31370, 31370, 39020, 39020, 39020, 37020, 21090, 31370, 34380, 34380, 34380, 32030, 32030, 32030, 21090, 21090, 21090, 39020, 32060, 32060, 32060, 37020, 37020, 37020, 32060, 32060, 32060, 35040, 37020, 37020, 37020, 32060, 32060, 32060, 35040, 37020, 37020, 37020, 37020, 37020, 37020, 32060, 37020, 37020, 39020, 39020, 39020, 37020, 37020, 32030, 32030, 37020, 39020, 39020, 37020, 34050, 31370, 31370, 37020, 37020, 32030, 32030, 34050, 31370, 31370, 31370, 37020, 32030, 32030, 34050, 21090, 21090, 21090, 21090, 32060, 32060, 32060, 21090, 21090, 21090, 32060, 32060, 32060, 35040, 21090, 21090, 37020, 32060, 32060, 35040, 35040, 37020, 37020, 37020, 37020, 37020, 37020, 32060, 37020, 37020, 39020, 39020, 37020, 37020, 21090, 32030, 37020, 37020, 39020, 37020, 21090, 21090, 31370, 31370, 37020, 37020, 37020, 21090, 21090, 31370, 31370, 37020, 37020, 32030, 32030, 32030, 21090, 21090, 21090, 39020, 32060, 32060, 32060, 21090, 37020, 37020, 32060, 32060, 32060, 35040, 37020, 37020, 37020, 32060, 32060, 35040, 35040, 37020, 37020, 37020, 37020, 37020, 37020, 37020, 37020, 37020, 37020, 37020, 37020, 32030, 21090, 32030, 32030, 37020, 37020, 32030, 32030, 21090, 31370, 31370, 37020, 37020, 32030, 32030, 34050, 31370, 31370, 31370, 37020, 33380, 32030, 34050, 21090, 21090, 21090, 32060, 32060, 32060, 32060, 21090, 21090, 21090, 32060, 32060, 35040, 35040, 21090, 21090, 32060, 32060, 32060, 35040, 35040, 32030, 32030, 32060, 32060, 37020, 37020, 35040, 32030, 32030, 37020, 37020, 37020, 37020, 21090, 32030, 37020, 37020, 37020, 37020, 33380, 21090, 31370, 31370, 37020, 37020, 33380, 33380, 21090, 31370, 31370, 37020, 37020, 33380, 33380, 34050, 21090, 21090, 21090, 32030, 32060, 32060, 32060, 21090, 21090, 32030, 32030, 32060, 32060, 32030, 21090, 32030, 32030, 32060, 32060, 32060, 32030, 32030, 32030, 32030, 32060, 32060, 32060, 32060, 32030, 32030, 32030, 32060, 32060, 32060, 21090, 32030, 32030, 32030, 32030, 32030, 33380, 21090, 31370, 31370, 37020, 33380, 33380, 33380, 34050, 31370, 31370, 31370, 33380, 33380, 33380, 34050, 21090, 21090, 21090, 32060, 32060, 32060, 32060, 21090, 21090, 21090, 32060, 32060, 32060, 32060, 21090, 21090, 32030, 32060, 32060, 32060, 32060, 32030, 32030, 32030, 32060, 32060, 32060, 21090, 32030, 32030, 32030, 32060, 32060, 32060, 21090, 32030, 32030, 32030, 32030, 33380, 33380, 21090, 31370, 37020, 37020, 33380, 33380, 33380, 21090, 31370, 31370, 37020, 33380, 33380, 33380, 33380));
    private HashMap<ArrayList<Integer>,Integer> ResultMap = new HashMap<>();
    private HashMap<Integer,String> ResulttoName = new HashMap<>();

    public SvmModel() {
        int count = 0;
        for (int i = 1; i < 13; i++) {
            for (int x = 1; x<3;x++) {
                for(int y = 1;y<9;y++ ) {
                    for(int z = 1; z < 8; z++) {
                        ArrayList<Integer> a = new ArrayList<>(Arrays.asList(x,z,y,i));
                        ResultMap.put(a,ResultCode.get(count));
                        count ++;
                    }
                }
            }
        }

        ResulttoName.put(11230,"서울 강남구");
        ResulttoName.put(11250,"서울 강동구");
        ResulttoName.put(11090,"서울 강북구");
        ResulttoName.put(11160,"서울 강서구");
        ResulttoName.put(11210,"서울 관악구");
        ResulttoName.put(11050,"서울 광진구");
        ResulttoName.put(11170,"서울 구로구");
        ResulttoName.put(11180,"서울 금천구");
        ResulttoName.put(11110,"서울 노원구");
        ResulttoName.put(11100,"서울 도봉구");
        ResulttoName.put(11060,"서울 동대문구");
        ResulttoName.put(11200,"서울 동작구");
        ResulttoName.put(11140,"서울 마포구");
        ResulttoName.put(11130,"서울 서대문구");
        ResulttoName.put(11220,"서울 서초구");
        ResulttoName.put(11040,"서울 성동구");
        ResulttoName.put(11080,"서울 성북구");
        ResulttoName.put(11240,"서울 송파구");
        ResulttoName.put(11150,"서울 양천구");
        ResulttoName.put(11190,"서울 영등포구");
        ResulttoName.put(11030,"서울 용산구");
        ResulttoName.put(11120,"서울 은평구");
        ResulttoName.put(11010,"서울 종로구");
        ResulttoName.put(11020,"서울 중구");
        ResulttoName.put(11070,"서울 중랑구");


        ResulttoName.put(21120,"부산 강서구");
        ResulttoName.put(21110,"부산 금정구");
        ResulttoName.put(21070,"부산 남구");
        ResulttoName.put(21030,"부산 동구");
        ResulttoName.put(21060,"부산 동래구");
        ResulttoName.put(21050,"부산 부산진구");
        ResulttoName.put(21080,"부산 북구");
        ResulttoName.put(21150,"부산 사상구");
        ResulttoName.put(21100,"부산 사하구");
        ResulttoName.put(21020,"부산 서구");
        ResulttoName.put(21140,"부산 수영구");
        ResulttoName.put(21130,"부산 연제구");
        ResulttoName.put(21040,"부산 영도구");
        ResulttoName.put(21010,"부산 중구");
        ResulttoName.put(21090,"부산 해운대구");
        ResulttoName.put(21310,"부산 기장군");



        ResulttoName.put(22040,"대구 남구");
        ResulttoName.put(22070,"대구 달서구");
        ResulttoName.put(22020,"대구 동구");
        ResulttoName.put(22050,"대구 북구");
        ResulttoName.put(22030,"대구 서구");
        ResulttoName.put(22060,"대구 수성구");
        ResulttoName.put(22010,"대구 중구");
        ResulttoName.put(22310,"대구 달성군");




        ResulttoName.put(23070,"인천 계양구");
        ResulttoName.put(23030,"인천 남구");
        ResulttoName.put(23050,"인천 구동구");
        ResulttoName.put(20020,"인천 동구");
        ResulttoName.put(23060,"인천 부평구");
        ResulttoName.put(23080,"인천 서구");
        ResulttoName.put(23040,"인천 연수구");
        ResulttoName.put(23010,"인천 중구");
        ResulttoName.put(23310,"인천 강화군");
        ResulttoName.put(23320,"인천 용진군");


        ResulttoName.put(25050,"대전 대덕구");
        ResulttoName.put(25010,"대전 동구");
        ResulttoName.put(25030,"대전 서구");
        ResulttoName.put(25040,"대전 유성구");
        ResulttoName.put(25020,"대전 중구");
        ResulttoName.put(25010,"대전 세종시");


        ResulttoName.put(24030,"광주 광산구");
        ResulttoName.put(24030,"광주 남구");
        ResulttoName.put(24040,"광주 동구");
        ResulttoName.put(24010,"광주 북구");
        ResulttoName.put(24310,"광주 서구");

        ResulttoName.put(31100,"경기 고양시");
        ResulttoName.put(31110,"경기 과천시");
        ResulttoName.put(31060,"경기 광명시");
        ResulttoName.put(31250,"경기 광주시");
        ResulttoName.put(31120,"경기 구리시");
        ResulttoName.put(31160,"경기 군포시");
        ResulttoName.put(31230,"경기 김포시");
        ResulttoName.put(31130,"경기 남양주시");
        ResulttoName.put(31080,"경기 동두천시");
        ResulttoName.put(31050,"경기 부천시");
        ResulttoName.put(31020,"경기 성남시");
        ResulttoName.put(31010,"경기 수원시");
        ResulttoName.put(31150,"경기 시흥시");
        ResulttoName.put(31090,"경기 안산시");
        ResulttoName.put(31220,"경기 안성시");
        ResulttoName.put(31040,"경기 안양시");
        ResulttoName.put(31260,"경기 양주시");
        ResulttoName.put(31140,"경기 오산시");
        ResulttoName.put(31190,"경기 용인시");
        ResulttoName.put(31170,"경기 의왕시");
        ResulttoName.put(31030,"경기 의정부시");
        ResulttoName.put(31210,"경기 이천시");
        ResulttoName.put(31200,"경기 파주시");
        ResulttoName.put(31070,"경기 평택시");
        ResulttoName.put(31270,"경기 포천시");
        ResulttoName.put(31180,"경기 하남시");
        ResulttoName.put(31240,"경기 화성시");
        ResulttoName.put(31370,"경기 가평군");
        ResulttoName.put(31380,"경기 양평군");
        ResulttoName.put(31280,"경기 여주시");
        ResulttoName.put(31350,"경기 연천군");


        ResulttoName.put(32030,"강원 강릉시");
        ResulttoName.put(32040,"강원 동해시");
        ResulttoName.put(32070,"강원 삼척시");
        ResulttoName.put(32060,"강원 속초시");
        ResulttoName.put(32020,"강원 원주시");
        ResulttoName.put(32010,"강원 춘천시");
        ResulttoName.put(32050,"강원 태백시");
        ResulttoName.put(32400,"강원 고성군");
        ResulttoName.put(32380,"강원 양구군");
        ResulttoName.put(32410,"강원 양양군");
        ResulttoName.put(32330,"강원 영월군");
        ResulttoName.put(32390,"강원 인제군");
        ResulttoName.put(32350,"강원 정선군");
        ResulttoName.put(32360,"강원 철원군");
        ResulttoName.put(32340,"강원 평창군");
        ResulttoName.put(32310,"강원 홍천군");
        ResulttoName.put(32370,"강원 화천군");
        ResulttoName.put(32320,"강원 횡성군");

        ResulttoName.put(33030,"충북 제천시");
        ResulttoName.put(33040,"충북 청주시");
        ResulttoName.put(33020,"충북 충주시");
        ResulttoName.put(33360,"충북 괴산군");
        ResulttoName.put(33380,"충북 단양군");
        ResulttoName.put(33320,"충북 보은군");
        ResulttoName.put(33340,"충북 영동군");
        ResulttoName.put(33330,"충북 옥천군");
        ResulttoName.put(33370,"충북 음성군");
        ResulttoName.put(33390,"충북 증평군");
        ResulttoName.put(33350,"충북 진천군");


        ResulttoName.put(34070,"충남 계룡시");
        ResulttoName.put(34020,"충남 공주시");
        ResulttoName.put(34060,"충남 논산시");
        ResulttoName.put(34030,"충남 보령시");
        ResulttoName.put(34050,"충남 서산시");
        ResulttoName.put(34040,"충남 아산시");
        ResulttoName.put(34010,"충남 천안시");
        ResulttoName.put(34310,"충남 금산군");
        ResulttoName.put(34080,"충남 당진시");
        ResulttoName.put(34330,"충남 부여군");
        ResulttoName.put(34340,"충남 서천군");
        ResulttoName.put(34370,"충남 예산군");
        ResulttoName.put(34350,"충남 청양군");
        ResulttoName.put(34380,"충남 태안군");
        ResulttoName.put(34360,"충남 홍성군");


        ResulttoName.put(37100,"경북 경산시");
        ResulttoName.put(37020,"경북 경주시");
        ResulttoName.put(37050,"경북 구미시");
        ResulttoName.put(37030,"경북 김천시");
        ResulttoName.put(37090,"경북 문경시");
        ResulttoName.put(37080,"경북 상주시");
        ResulttoName.put(37040,"경북 안동시");
        ResulttoName.put(37060,"경북 영주시");
        ResulttoName.put(37070,"경북 영천시");
        ResulttoName.put(37010,"경북 포항시");
        ResulttoName.put(37370,"경북 고령군");
        ResulttoName.put(37310,"경북 근위군");
        ResulttoName.put(37410,"경북 봉화군");
        ResulttoName.put(37380,"경북 성주군");
        ResulttoName.put(37350,"경북 영덕군");
        ResulttoName.put(37340,"경북 영양군");
        ResulttoName.put(37400,"경북 예천군");
        ResulttoName.put(37430,"경북 울릉군");
        ResulttoName.put(37420,"경북 울진군");
        ResulttoName.put(37320,"경북 의성군");
        ResulttoName.put(37360,"경북 청도군");
        ResulttoName.put(37330,"경북 청송군");
        ResulttoName.put(37390,"경북 칠곡군");


        ResulttoName.put(38090,"경남 거제시");
        ResulttoName.put(38070,"경남 김해시");
        ResulttoName.put(38080,"경남 밀양시");
        ResulttoName.put(38060,"경남 사천시");
        ResulttoName.put(38100,"경남 양산시");
        ResulttoName.put(38030,"경남 진주시");
        ResulttoName.put(38110,"경남 창원시");
        ResulttoName.put(38050,"경남 통영시");
        ResulttoName.put(38390,"경남 거창군");
        ResulttoName.put(38340,"경남 고성군");
        ResulttoName.put(38350,"경남 남해군");
        ResulttoName.put(38370,"경남 산청군");
        ResulttoName.put(38310,"경남 의령군");
        ResulttoName.put(38330,"경남 창녕군");
        ResulttoName.put(38360,"경남 하동군");
        ResulttoName.put(38320,"경남 함안군");
        ResulttoName.put(38380,"경남 함양군");
        ResulttoName.put(38400,"경남 합천군");

        ResulttoName.put(35020,"전북 군산시");
        ResulttoName.put(35060,"전북 김제시");
        ResulttoName.put(35050,"전북 남원시");
        ResulttoName.put(35030,"전북 익산시");
        ResulttoName.put(35010,"전북 전주시");
        ResulttoName.put(35040,"전북 정읍시");
        ResulttoName.put(35370,"전북 고창군");
        ResulttoName.put(35330,"전북 무주군");
        ResulttoName.put(35380,"전북 부안군");
        ResulttoName.put(35360,"전북 순창군");
        ResulttoName.put(35310,"전북 완주군");
        ResulttoName.put(35350,"전북 임실군");
        ResulttoName.put(35340,"전북 장수군");
        ResulttoName.put(35320,"전북 진안군");


        ResulttoName.put(36060,"전남 광양시");
        ResulttoName.put(36040,"전남 나주시");
        ResulttoName.put(36010,"전남 목포시");
        ResulttoName.put(36030,"전남 순천시");
        ResulttoName.put(36020,"전남 여수시");
        ResulttoName.put(36390,"전남 강진군");
        ResulttoName.put(36350,"전남 고흥군");
        ResulttoName.put(36320,"전남 곡성군");
        ResulttoName.put(36330,"전남 구례군");
        ResulttoName.put(36310,"전남 담양군");
        ResulttoName.put(36420,"전남 무안군");
        ResulttoName.put(36360,"전남 보성군");
        ResulttoName.put(36480,"전남 신안군");
        ResulttoName.put(36440,"전남 영광군");
        ResulttoName.put(36410,"전남 영암군");
        ResulttoName.put(36460,"전남 완도군");
        ResulttoName.put(36450,"전남 장성군");
        ResulttoName.put(36380,"전남 장흥군");
        ResulttoName.put(36470,"전남 진도군");
        ResulttoName.put(36430,"전남 함평군");
        ResulttoName.put(36400,"전남 해남군");
        ResulttoName.put(36370,"전남 화순군");

        ResulttoName.put(39010,"제주시");
        ResulttoName.put(39020,"제주 서귀포시");




//        ArrayList<Integer> testlist = new ArrayList<>(Arrays.asList(1,1,1,1));
//        Log.w("SSSVVVMMM",ResultMap.get(testlist).toString());
    }



    public String ChangeCode(int code){
        String name = ResulttoName.get(code);
        return name;
    }

    public String Search(ArrayList<Integer> lists) {
        int a = ResultMap.get(lists);
        String key = ResulttoName.get(a);
        return key;
    }
}
